nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/driver_examples/pwm/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC11 (number 37), U16[25]/TXD1
  @{ */
#define BOARD_TXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_TXD1_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_TXD1_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC12 (number 38), U16[26]/RXD1
  @{ */
#define BOARD_RXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_RXD1_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_RXD1_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOE0 (number 45), J3[13]/U15A[1]/PWMA_0B
  @{ */
#define BOARD_LED0_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED0_PIN 0U              /*!<@brief GPIOE pin index: 0 */
#define BOARD_LED0_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE1 (number 46), J3[15]/U15B[3]/PWMA_0A
  @{ */
#define BOARD_LED1_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED1_PIN 1U              /*!<@brief GPIOE pin index: 1 */
#define BOARD_LED1_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE3 (number 48), J3[11]/U15D[9]/PWMA_1A
  @{ */
#define BOARD_LED3_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED3_PIN 3U              /*!<@brief GPIOE pin index: 3 */
#define BOARD_LED3_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE5 (number 52), J3[7]/U15F[13]/PWMA_2A
  @{ */
#define BOARD_LED5_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED5_PIN 5U              /*!<@brief GPIOE pin index: 5 */
#define BOARD_LED5_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOF4 (number 41), J1[8]/D7/USER_LED3
  @{ */
#define BOARD_LED_BLUE_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_BLUE_PIN 4U              /*!<@brief GPIOF pin index: 4 */
#define BOARD_LED_BLUE_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
